Plate1atU2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         50;

deltaT          0.005;

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //


functions
{

forces
{
	type			forces;
	functionObjectLibs	("libforces.so");
	outputControl		timeStep;
	outputInterval		10;
	
	patches			("Plate");
	pName			p;
	UName			U;
	rho			rhoInf;
  //	rhoName			rhoInf;  // OF-2.3.x
  	log			true;
  	CofR			(0 0 0);
  	rhoInf			1.225;
 }
 
 forceCoeffs
 {
	type			forceCoeffs;
	functionObjectLibs	("libforces.so");
	outputControl		timeStep;
	outputInterval		10;
	
	patches			("Plate");
	pName			p;
	UName			U;
	rho			rhoInf;
  //	rhoName			rhoInf;  // OF-2.3.x
  	log			true;

	liftDir			(0 1 0);
	dragDir			(1 0 0);
	CofR			(0 0 0);
	pitchAxis		(0 0 1);
	
	magUInf			1;
	rhoInf			1.225;
	lRef			1;
	Aref			2;
 }
 
 }
